<a href="https://colab.research.google.com/github/ralsouza/data_visualization_with_python/blob/master/notebooks/17_python_pandas_dataframes_indexes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas DataFrames
Dataframes is 2-D objects.

In [0]:
import pandas as pd
import numpy as np
import string

In [17]:
# Making a dictionary
d1 = {'col1':[190,231,784,127],
      'col2':[545,278,104,347],
      'col3':[665,224,901,503],
      'col4':[123,456,789,763]};
d1

{'col1': [190, 231, 784, 127],
 'col2': [545, 278, 104, 347],
 'col3': [665, 224, 901, 503],
 'col4': [123, 456, 789, 763]}

In [18]:
# Converting d1 to dataframe object
df = pd.DataFrame(d1); df

   col1  col2  col3  col4
0   190   545   665   123
1   231   278   224   456
2   784   104   901   789
3   127   347   503   763

In [8]:
# Check the data types of each column
df.dtypes

col1    int64
col2    int64
col3    int64
col4    int64
dtype: object

In [9]:
# Using the column name as index to slice
df['col1']

0    190
1    231
2    784
3    127
Name: col1, dtype: int64

In [10]:
# Slicing by column name and index by row
df['col2'][0]

545

In [11]:
# Locating by index number
df.iloc[0]

col1    190
col2    545
col3    665
col4    123
Name: 0, dtype: int64

In [13]:
# Return the first two rows
df[:2]

   col1  col2  col3  col4
0   190   545   665   123
1   231   278   224   456

In [14]:
# Returning the index layout
df.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
# Insert another column to the dataframe
# Reading: In the first position on columns on index 0, add the column D with these values
df.insert(0,'ID',[1,2,3,4]); df

   ID  col1  col2  col3  col4
0   1   190   545   665   123
1   2   231   278   224   456
2   3   784   104   901   789
3   4   127   347   503   763

In [21]:
# Changing the index to ID columns
df2 = pd.DataFrame(df.set_index('ID')); df2

    col1  col2  col3  col4
ID
1    190   545   665   123
2    231   278   224   456
3    784   104   901   789
4    127   347   503   763